Конфигурация/DataProcessors/ВосстановлениеПоследовательностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ВосстановлениеПоследовательностей</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/СтатистикаРаботыВнутреннихМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СтатистикаРаботыВнутреннихМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияНачалоМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодВыполненияОкончаниеМС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПараметрыВыполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сеанс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СессияЗавершенаСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаВыполнения</Name>
					<Comment>Должна соответствовать дате из ПериодВыполненияНачало. Служит для групповой обработки записей</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/DataProcessors/ВосстановлениеПоследовательностей/Forms/Форма/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.ОтборПоСчетуДоверительногоУправления = ЗначениеЗаполнено(Объект.СчетДоверительногоУправления);
	ЭтаФорма.ОграничитьГраницуПоследовательности  = ЗначениеЗаполнено(Объект.ОграничениеГраницыПоследовательности);
	
	Элементы.СчетДоверительногоУправления.Видимость         = ЭтаФорма.ОтборПоСчетуДоверительногоУправления;
	Элементы.ОграничениеГраницыПоследовательности.Видимость = ЭтаФорма.ОграничитьГраницуПоследовательности;
	
	ОбновитьГраницыПоследовательностиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.ОтборПоСчетуДоверительногоУправления И Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Счет доверительного управления"" не заполнено");
	КонецЕсли;
	
	Если ЭтаФорма.ОграничитьГраницуПоследовательности И Не ЗначениеЗаполнено(Объект.ОграничениеГраницыПоследовательности) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поле ""Точка актуальности"" не заполнено");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВосстановитьВсе(Команда)
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Вопрос("Восстановить последовательности по всем счетам д/у? Процесс может занять продолжительное время.", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьМонопольныйРежимВызов(Истина);
	
	Для каждого СтрокаГраницыПоследовательности Из ГраницыПоследовательности Цикл
		Если Не СтрокаГраницыПоследовательности.Восстановлена Тогда
			ПровестиДокументыПоследовательностиНаСервере(СтрокаГраницыПоследовательности.СчетДоверительногоУправления);
		КонецЕсли;
		
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
	УстановитьМонопольныйРежимВызов(Ложь);
	
	ОбновитьГраницыПоследовательностиНаСервере();
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаПерепровестиВсеДокументыЗаПериод(Команда)
	
	ВыбПериод = Новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	
	ФормаВыбораПериода = ПолучитьФорму("ОбщаяФорма.ВыборПериода", Новый Структура("Период", ВыбПериод), ЭтаФорма);
	ВыбПериод          = ФормаВыбораПериода.ОткрытьМодально();
	
	Если ВыбПериод = КодВозвратаДиалога.Отмена Или ВыбПериод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВсеДокументыЗаПериод = ПолучитьВсеДокументыЗаПериод(Объект.Организация, Объект.СчетДоверительногоУправления, ВыбПериод);
	
	Всего = ВсеДокументыЗаПериод.Количество();
	
	Если Всего = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документов за указанный период не обнаружено.");
		Возврат;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Всего найдено документов: " + Всего + ".");
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Начало выполнения:" + ТекущаяДата());
	
	УстановитьМонопольныйРежимВызов(Истина);
	
	// проводить будем блоками, чтобы видеть прогресс
	Шаг         = 100;
	ИндНачБлока = 0;
	ИндКонБлока = Мин(Шаг - 1, Всего - 1);
	
	Пока Истина Цикл
		Если Не ПровестиДокументы(ВсеДокументыЗаПериод, ИндНачБлока, ИндКонБлока) Тогда
			Прервать;
		КонецЕсли;
			
		Состояние("Проведено документов " + (ИндКонБлока + 1) + "/" + Всего, Цел(ИндКонБлока / Всего * 100));
		
		ИндНачБлока = ИндНачБлока + Шаг;
		Если ИндНачБлока >= Всего Тогда
			Прервать;
		КонецЕсли;
		
		ИндКонБлока = Мин(ИндКонБлока + Шаг, Всего - 1);
		
		ОбработкаПрерыванияПользователя();
	КонецЦикла;
	
	УстановитьМонопольныйРежимВызов(Ложь);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Окончание выполнения:" + ТекущаяДата());
	
	КомандаОбновить(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов

&НаКлиенте
Процедура ОтборПоСчетуДоверительногоУправленияПриИзменении(Элемент)
	
	Элементы.СчетДоверительногоУправления.Видимость = ЭтаФорма.ОтборПоСчетуДоверительногоУправления;
	
	Если Не ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда 
		Возврат; // фактически без отбора по счету д/у, значит, ничего не поменялось
	КонецЕсли;
	
	Если Не ЭтаФорма.ОтборПоСчетуДоверительногоУправления Тогда
		Объект.СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничитьГраницуПоследовательностиПриИзменении(Элемент)
	
	Элементы.ОграничениеГраницыПоследовательности.Видимость = ЭтаФорма.ОграничитьГраницуПоследовательности;
	
	Если Не ЗначениеЗаполнено(Объект.ОграничениеГраницыПоследовательности) Тогда 
		Возврат; // фактически без ограничения границы, значит, ничего не поменялось
	КонецЕсли;
	
	Если Не ЭтаФорма.ОграничитьГраницуПоследовательности Тогда
		Объект.ОграничениеГраницыПоследовательности = Неопределено;
	КонецЕсли;
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничениеГраницыПоследовательностиПриИзменении(Элемент)
	
	ОбновитьГраницыПоследовательностиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ГраницыПоследовательностиПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ГраницыПоследовательности.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяКолонка = Элементы.ГраницыПоследовательности.ТекущийЭлемент;
	
	Если      ТекущаяКолонка = Элементы.ГраницыПоследовательностиСчетДоверительногоУправления Тогда
		ОткрытьЗначение(ТекущиеДанные.СчетДоверительногоУправления);
		
	ИначеЕсли ТекущаяКолонка = Элементы.ГраницыПоследовательностиГраницаРегистратор Тогда
		ОткрытьЗначение(ТекущиеДанные.ГраницаПоследовательности_Регистратор);
		
	ИначеЕсли ТекущаяКолонка = Элементы.ГраницыПоследовательностиТочкаАктуальностиРегистратор Тогда
		ОткрытьЗначение(ТекущиеДанные.ТочкаАктуальности_Регистратор);
		
	ИначеЕсли ТекущаяКолонка = Элементы.ГраницыПоследовательностиВосстановить И Не ТекущиеДанные.Восстановлена Тогда
		Если Вопрос("Восстановить последовательность документов по клиенту " + ТекущиеДанные.СчетДоверительногоУправления + "?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			УстановитьМонопольныйРежимВызов(Истина);
			
			ПровестиДокументыПоследовательностиНаСервере(ТекущиеДанные.СчетДоверительногоУправления);
				
			УстановитьМонопольныйРежимВызов(Ложь);
				
			ОбновитьГраницыПоследовательностиНаСервере();
		КонецЕсли;
		
	ИначеЕсли ТекущаяКолонка = Элементы.ГраницыПоследовательностиСостав Тогда
		ОткрытьФорму("Обработка.ВосстановлениеПоследовательностей.Форма.ДокументыПоследовательности",
			Новый Структура("Организация, СчетДоверительногоУправления, ОграничениеГраницыПоследовательности",
				Объект.Организация,
				ТекущиеДанные.СчетДоверительногоУправления,
				Объект.ОграничениеГраницыПоследовательности),
			ЭтаФорма);
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПровестиДокументыПоследовательностиНаСервере(СчетДоверительногоУправления)
		
	СчетаДоверительногоУправления = Новый Массив;
	СчетаДоверительногоУправления.Добавить(СчетДоверительногоУправления);
	
	Обработки.ВосстановлениеПоследовательностей.ВосстановитьПоследовательностиПоСчетамДоверительногоУправления(Объект.Организация, СчетаДоверительногоУправления, Объект.ОграничениеГраницыПоследовательности);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВсеДокументыЗаПериод(Организация, СчетДоверительногоУправления, Период)
	
	ПараметрыСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Новый Структура(), "", Новый Структура("Организация, СчетДоверительногоУправления, Период", Организация, СчетДоверительногоУправления, Период)); 
	Механизм			= "ВосстановлениеПоследовательностей.Форма.ПолучитьВсеДокументыЗаПериод()";
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);

	ШаблонПодзапроса =
		"ВЫБРАТЬ
		|		ИмяДокумента.Ссылка,
		|		ИмяДокумента.МоментВремени
		|	ИЗ
		|		Документ.ИмяДокумента КАК ИмяДокумента
		|	ГДЕ
		|		ИмяДокумента.Организация = &Организация
		|		И ИмяДокумента.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|		И ИмяДокумента.Проведен
		|		И ИмяДокумента.Дата МЕЖДУ &НачДата И &КонДата";
		
	Если Не ЗначениеЗаполнено(СчетДоверительногоУправления) Тогда
		ШаблонПодзапроса = СтрЗаменить(ШаблонПодзапроса, "И ИмяДокумента.СчетДоверительногоУправления = &СчетДоверительногоУправления" + Символы.ПС, "");
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеДокументы.Ссылка,
		|	ВсеДокументы.МоментВремени
		|ИЗ
		|	(Подзапросы) КАК ВсеДокументы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВсеДокументы.МоментВремени";
		
	Подзапросы = "";
		
	Для Каждого ДокументМД Из Метаданные.Документы Цикл
		
		Если ДокументМД.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить Тогда
			Продолжить;
		КонецЕсли;
		
		Подзапросы = Подзапросы + ?(ПустаяСтрока(Подзапросы), "", Символы.ПС + Символы.ПС + " ОБЪЕДИНИТЬ ВСЕ " + Символы.ПС) + СтрЗаменить(ШаблонПодзапроса, "ИмяДокумента", ДокументМД.Имя);
	КонецЦикла;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подзапросы", Подзапросы);
	
	Запрос.УстановитьПараметр("Организация",                  Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачДата",                      НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("КонДата",                      КонецДня(Период.ДатаОкончания));
	
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, Новый Структура("КоличествоДокументовКПерепроведению", ТаблицаДокументов.Количество()));
	
	Возврат ТаблицаДокументов.ВыгрузитьКолонку("Ссылка"); 
	
КонецФункции // ПолучитьВсеДокументыЗаПериод

&НаСервереБезКонтекста
Процедура УстановитьМонопольныйРежимВызов(Режим)
	
	Если Режим = Истина Тогда
		Попытка
			УстановитьМонопольныйРежим(Истина);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Включен монопольный режим");
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить монопольный режим. Система сообщает:" + ОписаниеОшибки());
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Проведение будет выполнено в разделяемом режиме. Это может занять большее кол-во времени.");
		КонецПопытки;
		
	Иначе	
		Если МонопольныйРежим() Тогда
			УстановитьМонопольныйРежим(Ложь);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отключен монопольный режим");
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // УстановитьМонопольныйРежимВызов

&НаСервереБезКонтекста
Функция ПровестиДокументы(ДокументыДляПроведения, НачИнд, КонИнд)
	
	ПараметрыСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(Новый Структура, "", Новый Структура("КоличествоДокументов", КонИнд - НачИнд)); 
	Механизм			= "ВосстановлениеПоследовательностей.Форма.ПровестиДокументы()";
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание); 
	
	Для Инд = НачИнд По КонИнд Цикл
		
		Документ = ДокументыДляПроведения[Инд].ПолучитьОбъект();
		Документ.ДополнительныеСвойства.Вставить("ГрупповоеПроведение", Истина);
		
		Попытка
			Документ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			
			ТекстОшибки = "Не удалось перепровести документ " + Документ; 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			
			РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,,, ТекстОшибки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перепроведение документов прервано.");
			Возврат Ложь;
			
		КонецПопытки;
		
	КонецЦикла;
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	Возврат Истина;
	
КонецФункции // ПровестиДокументы

&НаСервере
Процедура ОбновитьГраницыПоследовательностиНаСервере()
	
	ПараметрыСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтаФорма.Объект, "Организация, СчетДоверительногоУправления, ОграничениеГраницыПоследовательности"); 
	Механизм			= "ВосстановлениеПоследовательностей.Форма.ОбновитьГраницыПоследовательностиНаСервере()";
	Сессия				= РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыСтатистики.Хранилище, ПараметрыСтатистики.Описание);
	
	СостоянияПоследовательности = Обработки.ВосстановлениеПоследовательностей.ПолучитьСостоянияПоследовательностиОперацийПоСчетамДоверительногоУправления(
		Объект.Организация, 
		Объект.СчетДоверительногоУправления,
		Объект.ОграничениеГраницыПоследовательности);
		
	ЭтаФорма.ГраницыПоследовательности.Загрузить(СостоянияПоследовательности);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры // ОбновитьГраницыПоследовательностиНаСервере
